<br><br/>

 # <center>**Итоговая проверочная работа**</center> 

## Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе разработчик. Мы должны убедиться, что базовое знакомство с IT прошло успешно.  
## Задача алгоритмически не самая сложная, однако для полноценного выполнения проверочной работы необходимо: 
<br><br/>
<center>- Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете ее в отдельный метод.</center> 
<center>* Снабдить репозиторий оформленным текстовым описанием решения (файл READMY.md)</center> 
<center>+ Написать программу, решающую поставленную задачу. </center> 
<center>* Использовать контроль версий в работе над этим небольшим проектом ( не должно быть так, что все залито одним коммитом, как минимум этапы 2, 3 и 4 должны быть расположены в разных коммитах)</center> 

<br><br/>

## **Задача:** Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. Первоначальный массив можно ввести с клавиатуры, либо задавать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

<br><br/>

> #### ***Примеры:***

>> #### [“hello”, “2”, “world”, “:-)”] -> [“2”, “😊”]
>>>#### [“1234”, “1567”, “-2”, “computer science”] -> [“-2”]
>>>> #### [“Russia”, “Denmark”, “Kazan”] -> []


 # <center>**Программа с комментариями**</center> 


// Программа, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3 символа. 
<br><br/>
//////////////////////////////////////////////////////////////////////////
<br><br/>// Данный блок отвечает за количество элементов в массиве

<br><br/>Console.WriteLine("Введите количество элементов массива:");

int AmAl = int.Parse(Console.ReadLine()!); // вводим количество элементов с клавиатуры

string[] words; // объявляем строковый массив

words = new string[AmAl]; // задаем размер массива 

<br><br/>//////////////////////////////////////////////////////////////////////////
<br><br/>// Данный блок отвечает за ввод элементов массива с клавиатры

Console.WriteLine($"Введите {AmAl} элемента массива words");

for  (int i = 0; i < words.Length; i++) // цикл с кол-ом итераций рывным AmAL
{
    words[i] = Console.ReadLine()!; // непосредственный ввод элемента в строковом формате
}

Console.Write(" words [ "); 

for  (int i = 0; i < words.Length; i++) // вывод на печать получившегося массива
{
Console.Write($"{words[i]} ");
}
Console.Write("]");
Console.WriteLine();

 <br><br/>//////////////////////////////////////////////////////////////////////////
 <br><br/>// Блок отвечающий за проверку массива и выявление элементов которые меньше или равны 3<br><br/>
string[] NS = new string[AmAl]; // Объявляем новый строковый массив куда будем вписывать искомые значения.  <br><br/>
                                //По умолчанию размер массива такой-же как и проверяемый массив т.е. размер равен AmAL<br><br/>
int length=3; // объявляем целочисленную переменную с которой будем сравнивать размер элементов заданного массива<br><br/>
int count = 0; // объявляем  целочисленную переменную которая будет равнятся размеру нового массива <br><br/>

foreach  (string i in words) // перебираем массив по индексам и ищем элементы меньше или равные трем<br><br/>
      
   if ( i.Length > length ) // задаем условие на поиск элементы меньше или равные трем<br><br/>
   {<br><br/>
                
   }<br><br/>
   else<br><br/>
   {
    Console.WriteLine(i); // если находим элемент  меньше или равные трем то вносим их в новый массив NS<br><br/>
    NS[count] = i;
    count++;  

   }
     Console.Write("NS ["); // распечатываем новый массив с искомыми результатами
    foreach ( string ff in NS)
    {
       
        Console.Write($" {ff}"); 
                 
    }
    Console.Write("]");

<br><br/>//////////////////////////////////////////////////////////////////////////